{
    "changelog": [
        {
            "v": "1.0.0",
            "title": "Official Launch",
            "date": "TBA",
            "year": "2022",
            "new": [
                "Guitardex is launched to the public."
            ]
        },
        {
            "v": "0.9.1",
            "title": "Closed Beta Launch",
            "date": "TBA",
            "year": "2022",
            "new": [
                "Guitardex is launched to a select group of volunteer testers of the end-users: Learners, Teachers, and Professional Musicians."
            ]
        },
        {
            "v": "0.6.2",
            "title": "Color Scheme Overhaul",
            "date": "Apr 17",
            "year": "2022",
            "new": [
                "Techniques search page and Guitardex now shows color coded difficulty markers.",
                "Techniques search page now shows category markers",
                "Guitardex now shows category and group markers",
                "Technique pages now has the page header (reqs, difficulty, group, category, save button) visibly separate from the content below."
            ]
        },
        {
            "v": "0.6.1",
            "title": "User Interface Overhaul",
            "date": "Apr 12",
            "year": "2022",
            "new": [
                "Guitardex profile names are now displayed as the page heading to make the profile name have more visual impact instead of 'My Guitardex' with an input box below. Unnamed profiles now have a placeholder of 'My Guitardex' displayed above instead.",
                "A maximum character length of 24 is now shown with a counter when editing the profile",
                "Guitardex now shows a drag icon when hovered."
            ]
        },
        {
            "v": "0.5.2",
            "title": "Improved Technique Button UI",
            "date": "Apr 8",
            "year": "2022",
            "new": [
                "Changed technique buttons from box and checkmark to save icon and checkmark.",
                "Revamped save button and delete button UI to be more minimalistic.",
                "Bug Fix: Erasing Guitardex name using CTRL/CMD hotkeys now work."
            ]
        },
        {
            "v": "0.5.1",
            "title": "Created Necessary Pages",
            "date": "Apr 2",
            "year": "2022",
            "new": [
                "Added pages Help, About, and Community. Development (this) page was also added."
            ]
        },
        {
            "v": "0.4.2",
            "title": "My Guitardex UX",
            "date": "Mar 24",
            "year": "2022",
            "new": [
                "Added a way to delete individual entries of the Guitardex.",
                "Added a way to delete all entries of the Guitardex.",
                "Added a way to re-order entries of the Guitardex, which also updates the Guitardex's browser save accordingly."
            ]
        },
        {
            "v": "0.4.1",
            "title": "My Guitardex",
            "date": "Mar 12",
            "year": "2022",
            "new": [
                "'My Guitardex' page displays the saved techniques of the end-user.",
                "Encodes the save configuration to a short URL to share the user's Guitardex with others.",
                "Added automatic decoding of a custom Guitardex URL upon visit to the site via the URL."
            ]
        },
        {
            "v": "0.3.2",
            "title": "Technique Search",
            "date": "Mar 2",
            "year": "2022",
            "new": [
                "Added a Searchbar that queries search terms of the technique titles and their tags.",
                "Added Guitardex browser saving functionality and put a save button on the Searchbar page and each individual technique page."
            ]
        },
        {
            "v": "0.3.1",
            "title": "Technique Pages",
            "date": "Feb 27",
            "year": "2022",
            "new": [
                "Created the content structure to individually generate technique pages.",
                "Created template skeletons of what the technique pages would look like."
            ]
        },
        {
            "v": "0.2.1",
            "title": "Dark Mode",
            "date": "Feb 19",
            "year": "2022",
            "new": [
                "Allows end-users to freely toggle between light and dark theme (defaults to light).",
                "User's browser remembers the color mode preference of the end-user."
            ]
        },
        {
            "v": "0.1.1",
            "title": "Website Skeleton",
            "date": "Feb 04",
            "year": "2022",
            "new": [
                "The start of this website."
            ]
        }
    ]
}